{
    "name": "Brayan Ivan",
    "last_name": "Perez Ventura",
    "role": "Ingeniero en Software y Tecnologías Emergentes",
    "email": "brayan.ivan@example.com",
    "location": "Ensenada, Baja California, México",
    "description": "Apasionado por crear aplicaciones web eficientes y escalables con un enfoque en la experiencia del usuario.",
    "about-me": "Hola, soy estudiante de Ingeniería en Software apasionado por resolver problemas complejos, normalmente utilizando TypeScript, Python y algunos snacks. Me especializo en el desarrollo backend, buscando que las soluciones funcionen correctamente desde el primer intento (aunque no hay garantías). \n NestJS y FastAPI forman parte de mis herramientas del día a día, y actualmente estoy explorando el desarrollo frontend para fortalecer mi perfil full-stack. Fuera del código, paso tiempo en el gimnasio, investigando nuevas librerías o jugando Overwatch (main Genji) con mis amigos. Me gusta crear, aprender, experimentar con nuevas tecnologías y resolver problemas constantemente.",
    "skils": [
        "JavaScript",
        "TypeScript",
        "React",
        "Node.js",
        "Express",
        "PostgreSQL",
        "HTML5",
        "CSS3",
        "Git",
        "Docker",
        "Linux"
    ],
    "projects": [
        {
            "name": "Project One",
            "description": "A web application that does amazing things."
        },
        {
            "name": "Project Two",
            "description": "Another project that showcases my skills."
        },
        {
            "name": "Project Three",
            "description": "An innovative solution to a common problem."
        },
        {
            "name": "Project Four",
            "description": "A cutting-edge app built with modern technologies."
        }
    ],
    "experience": [
        {
            "company": "Company 1",
            "role": "Role",
            "duration": "Jan 2020 - Present",
            "responsibilities": [
                "Developed and maintained web applications using React and Node.js.",
                "Collaborated with cross-functional teams to define project requirements.",
                "Implemented RESTful APIs and integrated third-party services."
            ]
        },
        {
            "company": "Company 2",
            "role": "Role",
            "duration": "Jun 2018 - Dec 2019",
            "responsibilities": [
                "Assisted in the development of client websites and applications.",
                "Participated in code reviews and contributed to team knowledge sharing.",
                "Maintained documentation for various projects."
            ]
        }
    ],
    "socials": {
        "github": "https://github.com/keiwv",
        "linkedin": "https://www.linkedin.com/in/brayanperez56/"
    }
}
