{
    "name": "Brayan Ivan",
    "last_name": "Perez Ventura",
    "role": "Ingeniero de Software y Estudiante de Tecnologías Emergentes",
    "email": "brayan.ivan@example.com",
    "location": "Ensenada, Baja California, México",
    "description": "Apasionado por crear aplicaciones web eficientes y escalables con enfoque en la experiencia del usuario.",
    "about-me": [
        "Hola, soy un estudiante de Ingeniería de Software apasionado por resolver problemas complejos, generalmente usando TypeScript, Python y algunos snacks. Me enfoco en el desarrollo backend, buscando que las soluciones funcionen desde el primer intento (aunque sin garantías).",
        "NestJS y FastAPI forman parte de mi kit diario de herramientas, y actualmente estoy explorando el desarrollo frontend para fortalecer mi perfil full-stack.",
        "Fuera de la programación, paso tiempo en el gimnasio, buscando nuevas librerías o jugando Overwatch (Genji main) con amigos. Disfruto crear, aprender, experimentar con nuevas tecnologías y resolver problemas constantemente."
    ],
    "skils": [
        "JavaScript",
        "TypeScript",
        "React",
        "Node.js",
        "Express",
        "PostgreSQL",
        "HTML5",
        "CSS3",
        "Git",
        "Docker",
        "Linux"
    ],
    "projects": [
        {
            "index": 0,
            "name": "Sippy",
            "description": "Plataforma móvil multiplataforma desarrollada con backend en Node.js y frontend en React Native. El proyecto destaca por su implementación de una arquitectura escalable capaz de manejar algoritmos de feed dinámicos, procesamiento distribuido en Azure y gestión compleja de bases de datos relacionales y NoSQL.",
            "contibutions": [
                "Diseñé esquemas de bases de datos y APIs RESTful usando NestJS.",
                "Optimicé consultas NoSQL para mejorar el rendimiento de recuperación de datos.",
                "Uso de GraphQL para agilizar la obtención de datos entre frontend y backend.",
                "Desplegué y gestioné servicios en la nube en Microsoft Azure."
            ],
            "skills": [
                "JavaScript",
                "React Native",
                "NestJS",
                "Azure"
            ]
        },
        {
            "index": 1,
            "name": "Nasa Explorer",
            "description": "Motor de conocimiento de biología espacial que utiliza IA para resumir publicaciones científicas de la NASA. Permite a los investigadores explorar décadas de información usando procesamiento de lenguaje natural y búsqueda semántica.",
            "awards": "1er Lugar Hackathon Local NASA",
            "contibutions": [
                "Despliegue de servicios de IA basados en RAG usando NestJS.",
                "Integración de técnicas RAG para mejorar la recuperación de información de grandes conjuntos de datos.",
                "Servicios desplegados en Google Cloud Platform"
            ],
            "skills": [
                "Generación Aumentada por Recuperación",
                "NestJS",
                "Servicios de Google Cloud"
            ],
            "imgs": [
                "/projects/nasa.png"
            ]
        },
        {
            "index": 2,
            "name": "CTQAlert",
            "description": "Plataforma web para aseguramiento de calidad de productos con sistema de notificaciones en tiempo real y panel de administración para gestión de usuarios y productos, implementada con arquitectura de múltiples servicios.",
            "skills": ["TypeScript", "Express", "PostgreSQL"]
        }
    ],
    "experience": [
        {
            "company": "Company 1",
            "role": "Role",
            "duration": "Ene 2020 - Presente",
            "responsibilities": [
                "Desarrollé y mantuve aplicaciones web usando React y Node.js.",
                "Colaboré con equipos multidisciplinarios para definir requisitos del proyecto.",
                "Implementé APIs RESTful e integré servicios de terceros."
            ]
        },
        {
            "company": "Company 2",
            "role": "Role",
            "duration": "Jun 2018 - Dic 2019",
            "responsibilities": [
                "Asistí en el desarrollo de sitios web y aplicaciones para clientes.",
                "Participé en revisiones de código y contribuí al intercambio de conocimientos del equipo.",
                "Mantuve la documentación de varios proyectos."
            ]
        }
    ],
    "socials": {
        "github": "https://github.com/keiwv",
        "linkedin": "https://www.linkedin.com/in/brayanperez56/"
    }
}
