{
    "name": "Brayan Ivan",
    "last_name": "Perez Ventura",
    "role": "Software Engineer & Emerging Technologies Student",
    "email": "brayan.ivan@example.com",
    "location": "Ensenada, Baja California, México",
    "description": "Passionate about crafting efficient and scalable web applications with a focus on user experience.",
    "about-me": [
        "Hi, I'm a Software Engineering student passionate about solving complex problems, usually using TypeScript, Python, and a few snacks. I focus on backend development, aiming to make solutions work right from the first try (no guarantees though).",
        "NestJS and FastAPI are part of my daily toolkit, and I'm currently exploring frontend development to strengthen my full-stack profile.",
        "Outside of coding, I spend time at the gym, looking for new libraries, or playing Overwatch (Genji main) with friends. I enjoy creating, learning, experimenting with new technologies, and constantly solving problems."
    ],
    "skils": [
        "JavaScript",
        "TypeScript",
        "React",
        "Node.js",
        "Express",
        "PostgreSQL",
        "HTML5",
        "CSS3",
        "Git",
        "Docker",
        "Linux"
    ],
    "projects": [
        {
            "index": 0,
            "name": "Sippy",
            "description": "Cross-platform mobile platform developed with a Node.js backend and a React Native frontend. The project stands out for its implementation of a scalable architecture capable of handling dynamic feed algorithms, distributed processing on Azure, and complex management of both relational and NoSQL databases.",
            "contibutions": [
                "Designed database schemas and RESTful APIs using NestJS.",
                "Optimized NoSQL queries to enhance data retrieval performance.",
                "Using GraphQL to streamline data fetching between frontend and backend.",
                "Deployed and managed cloud services on Microsoft Azure."
            ],
            "skills": [
                "JavaScript",
                "React Native",
                "NestJS",
                "Azure"
            ]
        },
        {
            "index": 1,
            "name": "Nasa Explorer",
            "description": "A spatial biology knowledge engine that uses AI to summarize NASA scientific publications. It enables researchers to explore decades of information using natural language processing and semantic search.",
            "awards": "1st Place Local Hackathon NASA",
            "contibutions": [
                "Deploying RAG-based AI services using NestJS.",
                "Integrated RAG techniques to enhance information retrieval from large datasets.",
                "Deployed services on Google Cloud Platform"
            ],
            "skills": [
                "Retrieval-Augmented Generation",
                "NestJS",
                "Google Cloud Services"
            ],
            "imgs": [
                "/projects/nasa.png"
            ]
        },
        {
            "index": 2,
            "name": "CTQAlert",
            "description": "Web platform for product quality assurance featuring a real-time notification system and an administration panel for user and product management, implemented with a multiservice architecture.",
            "skills": ["TypeScript", "Express", "PostgreSQL"]
        }
    ],
    "experience": [
        {
            "company": "Company 1",
            "role": "Role",
            "duration": "Jan 2020 - Present",
            "responsibilities": [
                "Developed and maintained web applications using React and Node.js.",
                "Collaborated with cross-functional teams to define project requirements.",
                "Implemented RESTful APIs and integrated third-party services."
            ]
        },
        {
            "company": "Company 2",
            "role": "Role",
            "duration": "Jun 2018 - Dec 2019",
            "responsibilities": [
                "Assisted in the development of client websites and applications.",
                "Participated in code reviews and contributed to team knowledge sharing.",
                "Maintained documentation for various projects."
            ]
        }
    ],
    "socials": {
        "github": "https://github.com/keiwv",
        "linkedin": "https://www.linkedin.com/in/brayanperez56/"
    }
}
